CSI API ETABS v1
cAnalyze.GetActiveDOF Method
 Retrieves the model global degrees of freedom.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetActiveDOF(
	ref bool[] DOF
)
Function GetActiveDOF (
	ByRef DOF As Boolean()
) As Integer
Dim instance As cAnalyze
Dim DOF As Boolean()
Dim returnValue As Integer
returnValue = instance.GetActiveDOF(DOF)
int GetActiveDOF(
	array<bool>^% DOF
)
abstract GetActiveDOF :
        DOF : bool[] byref -> int
Parameters
DOF
Type: System.Boolean[]
Return Value
Type: Int32
 Returns zero if the degrees of freedom are successfully retrieved; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim DOF() As Boolean
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'get model degrees of freedom
       ret = SapModel.Analyze.GetActiveDOF(DOF)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cAnalyze Interface
ETABSv1 Namespace